package com.example.yourdestiny.model;

import com.example.yourdestiny.R;

public class GuidesInfo {
    private String[] Names = {"Источник Кошмаров",
            "Падение Короля",
            "Клятва Послушника",
            "Хранилище Стекла",
            "Склеп Глубокого Камня",
            "Сад Спасения",
            "Последнее Желание",

            "Призраки Глубины",
            "Шпиль Хранителя",
            "Дуальность",
            "Тиски Алчности",
            "Откровение",
            "Яма Ереси",
            "Расколотый Трон"};
    private String[] Predicat = {"Зловещая угроза укоренилась",
            "Да здравствует король",
            "Послушник призывает...",
            "Под Венерой взросло зло",
            "Цепи наследия должны быть разорваны",
            "Сад взывает к вам",
            "Возможность всей жизни",

            "Утонуть в бездне или подняться из нее",
            "В этих пыльных руинах творятся махинации. Приведи их в порядок...",
            "Погрузитесь в глубины разума изгнанного императора",
            "Поучительная история для авантюристов, желающих обменять свою человечность на богатство.",
            "Войдите в царство Девяти и задайте вопрос: «Какова природа Тьмы?»",
            "Глубоко под Гаванью Скорби Улей хранит свои самые мрачные тайны",
            "Нанеси ответный удар проклятию, поразившему Город Грез"};
    private int[] Difficult = {3, 4, 4, 2, 2, 3, 5, 3, 2, 3, 3, 3, 3, 4};
    private int[] Guide_pic = {R.drawable.ron,
            R.drawable.kf,
            R.drawable.vod,
            R.drawable.vog,
            R.drawable.dsc,
            R.drawable.gos,
            R.drawable.lw,

            R.drawable.god,
            R.drawable.sow,
            R.drawable.d,
            R.drawable.goa,
            R.drawable.p,
            R.drawable.poh,
            R.drawable.st};
    private String[][] Encounters = {{"Катаклизм", "Разделение", "Микрокосмом", "Незарек"},
            {"Врата", "Тотемы", "Жрец Войны", "Голгорот", "Дочери", "Орикс"},
            {"Приобретение", "Смотритель", "Выставка", "Рулк"},
            {"Конфлюкс", "Оракулы", "Темплар", "Привратник", "Атеон"},
            {"Охрана Склепа", "Атракс-1", "Восторг", "Таникс"},
            {"Уклонение", "Призывание", "Посвященный разум", "Освященный разум"},
            {"Калли", "Шуро'Чи", "Моргет", "Хранилище", "Ривен", "Сердце Ривен"},

            {"Риутал Улья", "Эктар", "Симмумах ур-Нокру"},
            {"Поднимитесь на Шпиль", "Заглушить шпиль", "Персис"},
            {"Кошмар Гахлрана", "Открытие Хранилища", "Кошмар Каятль"},
            {"Фризия", "Щит Падших", "Капитан Аварокк"},
            {"Эхо Фаланг", "Куб", "Эхо Келл"},
            {"Некрополис", "Палата страданий", "Зулмак"},
            {"Эребус", "Воргет", "Дул Инкару"}};
    private String[][] Encounters_descript = {
            {"Катаклизм",
                    "Разделение",
                    "Микрокосмом",
                    "Незарек"},
            {"Врата",
                    "Тотемы",
                    "Жрец Войны",
                    "Голгорот",
                    "Дочери",
                    "Орикс"},
            {"Приобретение",
                    "Смотритель",
                    "Выставка",
                    "Рулк"},
            {"Конфлюкс",
                    "Оракулы",
                    "Темплар",
                    "Привратник",
                    "Атеон"},
            {"Охрана Склепа",
                    "Атракс-1",
                    "Восторг",
                    "Таникс"},
            {"Уклонение",
                    "Призывание",
                    "Посвященный разум",
                    "Освященный разум"},
            {"Калли",
                    "Шуро'Чи",
                    "Моргет",
                    "Хранилище",
                    "Ривен",
                    "Сердце Ривен"},

            {"Риутал Улья",
                    "Эктар",
                    "Симмумах ур-Нокру"},
            {"Поднимитесь на Шпиль",
                    "Заглушить шпиль",
                    "Персис"},
            {"Кошмар Гахлрана",
                    "Открытие Хранилища",
                    "Кошмар Каятль"},
            {"Фризия",
                    "Щит Падших",
                    "Капитан Аварокк"},
            {"Эхо Фаланг",
                    "Куб",
                    "Эхо Келл"},
            {"Некрополис",
                    "Палата страданий",
                    "Зулмак"},
            {"Эребус",
                    "Воргет",
                    "Дул Инкару"}};

    public String getNames(int count) {
        return Names[count];
    }
    public String[] getNames() {
        return Names;
    }

    public String getPredicat(int count) {
        return Predicat[count];
    }

    public int getDifficult(int count) {
        return Difficult[count];
    }

    public int getGuide_pic(int count) {
        return Guide_pic[count];
    }

    public String[] getEncounters(int count) {
        return Encounters[count];
    }

    public String[] getEncounters_descript(int count) {
        return Encounters_descript[count];
    }

}
