package com.example.yourdestiny.model.armorDB;

import com.example.yourdestiny.R;

public class ArmorInfo {
    private String[] Name = {"Звездный Полуночник", "Маска Бакриса",
            "Осколки Галаноры", "Мудрость Тритона", "Омниокулюс",
            "Тень Дракона", "Установка Орфей",


            "Шлем Сейнта-14", "Одноглазая Маска",
            "Урса Фьюриоса", "Синтоцепсы", "Кираса Падающей Звезды",
            "Сердце Священного Пламени", "Застывший Прыжок",

            "Маска из Кенотафа", "Грех Незарека",
            "Некротическая Хватка", "Нарукавники Солнца", "Протокол Феникса",
            "Протокол Звездного Огня", "Сапоги Лунофракции"};
    private String[] Type = {"Шлем", "Шлем",
            "Рукавицы", "Рукавицы", "Нагрудник",
            "Нагрудник", "Ноги",


            "Шлем", "Шлем",
            "Рукавицы", "Рукавицы", "Нагрудник",
            "Нагрудник", "Ноги",

            "Шлем", "Шлем",
            "Рукавицы", "Рукавицы", "Нагрудник",
            "Нагрудник", "Ноги"};

    private int[] Pic = {R.drawable.armor_hawk, R.drawable.armor_bakr,
            R.drawable.armor_gal, R.drawable.armor_trit, R.drawable.armor_omni,
            R.drawable.armor_drag, R.drawable.armor_orph,


            R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk,

            R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk};
    private int[] Pic_back = {R.drawable.armor_hawk_s, R.drawable.armor_bark_s,
            R.drawable.armor_gal_s, R.drawable.armor_trir_s, R.drawable.armor_omni_s,
            R.drawable.armor_drag_s, R.drawable.armor_orph_s,


            R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk,

            R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk};
    private String[] Predicat = {"Тебя ведет звездный свет. Никакой вакуум тебе не помеха.",
            "«Я отбрасываю в сторону свой панцирь, чтобы возродиться, как и наш славный Риис», – Атракс-1, падшая экзо",
            "У меня не хватит мастерства починить Галанор\".\n" +
                    "\"…Я что-нибудь придумаю\".",
            "Вот что поможет мне одолеть Геракла.\n",
            "Замечай опасность, даже когда она не замечает тебя.",
            "\"Это честь для меня.\" — Чалко Йонг — Икоре Рей",
            "Никогда, никогда не оглядывайся.\n",


            "",
            "",
            "",
            "",
            "",
            "",
            "",

            "",
            "",
            "",
            "",
            "",
            "",
            ""
    };

    private int[] Exotic_pic = {R.drawable.armor_hawk_e, R.drawable.armor_bark_e,
            R.drawable.armor_gal_e, R.drawable.armor_trir_e, R.drawable.armor_omni_e,
            R.drawable.armor_drag_e, R.drawable.armor_orph_e,


            R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk,

            R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk, R.drawable.armor_hawk,
            R.drawable.armor_hawk, R.drawable.armor_hawk};
    private String[] Exotic_title = {"Орлиный глаз", "Световое смещение",
            "Острые края", "Наконечник алебарды", "Та сторона завесы",
            "Кольчуга из призрачного металла", "Невероятные стрелы",


            "", "",
            "", "", "",
            "", "",

            "", "",
            "", "", "",
            "", ""};
    private String[] Exotic_descrypt = {"Модифицирует Золотой пистолет так, чтобы он делал мощный одиночный выстрел. Враги, уничтоженные выстрелом, взрываются и восстанавливают энергию суперспособности.\n",
            "Заменяет способность «Уклонение» вашего стазисного подкласса более быстрым и дальним смещением, которое, помимо всего прочего, еще и частично скрывает вас из виду. В течение короткого времени после смещения ваше стазисное и электрическое оружие наносит дополнительный урон.\n",
            "Попадания и убийства способностью Шквал клинков восстанавливают суперспособность после ее дезактивации.\n",
            "Повышает скорость перезарядки глефы и урон в ближнем бою, когда вы окружены. Добивающее попадание глефой в ближнем бою переполняет магазин на один заряд. Если тип урона глефы совпадает со стихией вашего подкласса, то добивающие попадания снарядами глефы взрывают цели.\n",
            "В состоянии невидимости вы получаете второй заряд дымовой шашки и сопротивляемость урону. Союзники, которых вы делаете невидимыми, также получают сопротивляемость урону, а вы при этом восстанавливаете энергию ближнего боя.\n",
            "Уклонение перезаряжает все оружие и ненадолго повышает скорость перемещения и удобство оружия.\n",
            "Дает энергию способности за каждую цель, отмеченную якорем Западни. Добавляет стрелу в Колчан Мебиуса.\n",


            "",
            "",
            "",
            "",
            "",
            "",
            "",

            "",
            "",
            "",
            "",
            "",
            "",
            ""};

    private String[] Lore = {"Тебя ведет звездный свет. Никакой вакуум тебе не помеха.\n" +
            "\n" +
            "Я стою на земле наполовину в защите Мэв. К счастью, внутри моя верхняя половина. Звезды надо мной гаснут одна за другой, но, возможно, это просто слизь одержимых заслоняет обзор.\n" +
            "\n" +
            "Этот гигантский одноглазый урод, которого мы разбудили, совсем не рад нас видеть. Это не входило в наши планы. Мы просто хотели его ограбить.\n" +
            "\n" +
            "На Луне пусто. Рог затупился. Мэв то ли смеется, то ли умоляет о пощаде, поливая округу свинцом. Она проплывает мимо псионов, которые постоянно делятся. ХВАТИТ ДЕЛИТЬСЯ.\n" +
            "\n" +
            "У нас осталось совсем мало времени. Это наш последний шанс.\n" +
            "Я показываю уроду средний палец.\n" +
            "Один раскаленный докрасна палец.\n" +
            "\n",
            "«Я отбрасываю в сторону свой панцирь, чтобы возродиться, как и наш славный Риис», – Атракс-1, падшая экзо\n" +
                    "\n" +
                    "– Нет! Не трогай ее! Праксис это предвидел. Молчи!\n" +
                    "\n" +
                    "– Не слушай их, Атракс. Сосредоточься на моем голосе.\n" +
                    "\n" +
                    "– Это не ты, Атракс. Это не ты.\n" +
                    "\n" +
                    "– Не отворачивайся!\n" +
                    "\n" +
                    "– Это тело принадлежит кому-то другому. На ней маска. Всего лишь маска.\n" +
                    "\n" +
                    "– Сними маску.\n" +
                    "\n" +
                    "– Протяни руку и коснись ее. Славно. А теперь снимай.\n" +
                    "\n" +
                    "– Тяни сильнее!\n" +
                    "\n" +
                    "– Самозванка хитра. Маска закреплена. Ее нужно срезать. Возьми этот нож.\n" +
                    "\n" +
                    "– Не мешкай. Не тыкай в нее! Режь. Кромсай!\n" +
                    "\n" +
                    "– Да… Хорошо. Еще. Еще. Окропи руки кровью самозванки. Размажь ее повсюду. Хорошо!\n" +
                    "\n" +
                    "– Ну вот… дело сделано. Ты сорвала маску…\n" +
                    "\n" +
                    "– Разве похоже это на твое тело? Нет. Это пустая оболочка.\n" +
                    "\n" +
                    "– Я возьму эту маску и очищу ее. Когда другие будут носить ее, ты не увидишь в ней своего лица. Ты будешь знать, что это маска.",
            "\"У меня не хватит мастерства починить Галанор\". \"…Я что-нибудь придумаю\".\n" +
                    "\n" +
                    "Меч Галанора: избранная литература\n" +
                    "\n" +
                    "\"Клинок рассекающего пламени\", мифы и легенды Марса под ред. Хауэлл Гар.\n" +
                    "\n" +
                    "\"...и в центре водоема стояло существо из бронзы и ржавчины с головой ящера и туловищем человека. Ржавчина придала ему смиренную позу, и Галанор возлежал на его поднятых дланях...\"\n" +
                    "\n" +
                    "\"Аллитерационный Галанор\", энграмма Ориона 23.3.6.\n" +
                    "\n" +
                    "\"...он брел под бременем беды/ с ликующим влюбенным ликом / глядел на гордый Галанор...\"\n" +
                    "\"Теория суперметаллов Золотого века\". Вивиан Вэйленд.\n" +
                    "\n" +
                    "\"...способ изготовления печатных листов из углеткани, пронизанной жилами сверхнагретого жидкого металла, благодаря чему получается теплопроводящий, но очень стойкий материал. Его существование в целом не подвергают сомнению, но нам не удалось восстановить забытую технику его изготовления и ремонта...\"\n" +
                    "\n" +
                    "\"Анализ добычи с Венеры, Диндран-43-59\", криптарх Ярели.\n" +
                    "\n" +
                    "\"...экспериментальный спутник-зонд, способный входить в верхние слои мантии желтых звезд, известен под названием \"Галактика Норд\" или, сокращенно, \"ГалаНор\"...",
            "Вот что поможет мне одолеть Геракла.\n" +
                    "\n" +
                    "«Что… это такое?»\n" +
                    "\n" +
                    "«Это клешни главного хищника Титана. Миниатюрная копия, разумеется. Настоящие наверняка размером с нас, а то и больше».\n" +
                    "\n" +
                    "«Мне доводилось читать трактат Паханина о головоногих…»\n" +
                    "\n" +
                    "«Да нет же, это не кальмары, а крабы! Они идеальны! Форма, к которой неизбежно стремятся все живые существа! Даже на Нессе…»\n" +
                    "\n" +
                    "«Они не крабы. Откуда ты все это берешь?»\n" +
                    "\n" +
                    "«Из \"АванНета\". Ты знаешь, что чем дальше от Земли мы забираемся, тем больше находим крабов? Взять, к примеру, эликсни!»\n" +
                    "\n" +
                    "«У эликсни нет общих предков с обитателями Земли, так что не думаю, что наша таксономия может быть применена для…»\n" +
                    "\n" +
                    "«А как думаешь, до какого размера могут вырастать эликсни? Может, где-нибудь есть эликсни-гигант? Спрошу Варикса».\n" +
                    "\n" +
                    "«НЕ ВЗДУМАЙ спрашивать его об этом… Стой, вернись!»",
            "Замечай опасность, даже когда она не замечает тебя.\n" +
                    "\n" +
                    "Плоскогорья Несса, место крушения, день пятый\n" +
                    "\n" +
                    "**\n" +
                    "\n" +
                    "Поисковых групп Кабал здесь было великое множество. Фрегат перевозил что-то достаточно ценное, и, значит, это нужно было захватить.\n" +
                    "\n" +
                    "Дважды мне пришлось уклоняться от больших групп. Нет, не из трусости, просто перестрелка вышла бы очень шумной. Кроме того, мне не хотелось, чтобы они поняли, насколько близки к цели. Какое-то время пришлось тенью следовать за одним из больших вождей. Мне было противно находиться так близко от него – даже на горном воздухе.\n" +
                    "\n" +
                    "Наконец фрегат был найден. Он лежал в ущелье, вдалеке от групп разведчиков. Но, разумеется, у меня глаза поострее, чем у многих.\n" +
                    "\n" +
                    "Похоже, он упал из нижних слоев атмосферы, поэтому я прикинул, что груз, скорее всего, не пострадал. Нашел два больших ящика с золотом Кабал, несколько статуй, блюд, гонгов и прочего добра. Ценности я телепортировал, а остальное бросил.\n" +
                    "\n" +
                    "Я уже решил, что все пройдет отлично, как вдруг услышал звук, который неслабо меня напугал: голос. Слабый, негромкий – такой обычно бывает в самом конце.\n" +
                    "\n" +
                    "Под обломками коридора я нашел огромную воительницу Кабал. Пустил ее в расход без проблем. В соседней комнате, погребенной под завалами, обнаружился Носитель Света – израненный, обезвоженный, но живой.\n" +
                    "\n" +
                    "Кажется, Носитель Света был в шоке, но это просто бизнес, ничего личного. Удар прикладом в висок быстро его успокоил. Я бросил его в свой «Спэрроу» и выгрузил на базе разведчиков еще до того, как он очнулся. На аванпосте не ожидали, что кто-то выживет, поэтому плату из них пришлось выбивать.\n" +
                    "\n" +
                    "Работа у меня неблагодарная, ну да ничего. Спасибо в карман не положишь.",
            "\"Это честь для меня.\" — Чалко Йонг — Икоре Рей\n" +
                    "\n" +
                    "\"Найди себя\". — первое предписание, первое повеление, Тайные люди\n" +
                    "\"Познай себя\". — второе предписание, первое повеление, Тайные люди\n" +
                    "\"Уничтожь себя\". — третье предписание, первое повеление, Тайные люди\n" +
                    "\"Отринь себя\". — четвертое предписание, первое повеление, Тайные люди\n" +
                    "\"Полюби свою новую кожу\". — пятое предписание, первое повеление, Тайные люди\n" +
                    "\"Стань множеством\". — шестое предписание, первое повеление, Тайные люди\n" +
                    "\"Мы невидимы. Мы — смерть\". — последнее предписание, первое повеление, Тайные люди",
            "Никогда, никогда не оглядывайся.\n" +
                    "\n" +
                    "Квантис Ри почти забыла, что такое краски дня. Долгие месяцы она бродила по глубоким, мрачным катакомбам Несса – места, где неутомимые вексы вгрызались в непокорную планету и заменяли естественную жизнь холодным, нечеловеческим лабиринтом.\n" +
                    "\n" +
                    "Туда редко проникал Свет. Но Квантис знала, как его найти – как почувствовать гладь среди волн Пустоты и притянуть Свет из бесконечности между пространствами. Она умела создавать черные дыры между кончиками пальцев и натягивать тетиву своего лука с помощью неумолимой гравитации вселенной.\n" +
                    "\n" +
                    "Вскоре Квантис покинет это место – и вернется в Город, чтобы сообщить о своих открытиях. Снова любоваться яркими красками. Но недолго. Она ночной охотник. Здесь, на неуловимо тонкой грани между жизнью и смертью, ее настоящее место.",


            "",
            "",
            "",
            "",
            "",
            "",
            "",


            "",
            "",
            "",
            "",
            "",
            "",
            ""};

    private String[] For_class = {"Охотник", "Охотник",
            "Охотник", "Охотник", "Охотник",
            "Охотник", "Охотник",


            "Титан", "Титан",
            "Титан", "Титан", "Титан",
            "Титан", "Титан",

            "Варлок", "Варлок",
            "Варлок", "Варлок", "Варлок",
            "Варлок", "Варлок"};

    private String[] For_subclass = {"Огонь", "Стазис",
            "Огонь", "Пустота", "Пустота",
            "Нить", "Пустота",


            "Пустота", "Электричество",
            "Пустота", "Элестричество", "Элестричество",
            "Огонь", "Нить",

            "Огонь", "Пустота",
            "Нить", "Огонь", "Огонь",
            "Огонь", "Электричество"};

    private String[] For_activity = {"Рейд", "Горнило",
            "Гамбит", "Налет", "Рейд",
            "Горнило", "Рейд",


            "Рейд", "Горнило",
            "Налет", "Горнило", "Рейд",
            "Гамбит", "Налет",

            "Рейд", "Налет",
            "Налет", "Горнило", "Рейд",
            "Рейд", "Налет"};

    private String[] neww = {"", "Новое",
            "", "Новое", "",
            "", "",


            "", "",
            "", "", "Новое",
            "", "Новое",

            "Новое", "",
            "Новое", "", "",
            "", ""};

    public String getLore(int count){
        return Lore[count];
    }
    public String getClas(int count){
        return For_class[count];
    }
    public String getSubclas(int count){
        return For_subclass[count];
    }
    public String getActivityy(int count){
        return For_activity[count];
    }
    public String getName(int count){
        return Name[count];
    }
    public String getType(int count) {
        return Type[count];
    }

    public int getPic(int count) {
        return Pic[count];
    }

    public int getPic_back(int count) {
        return Pic_back[count];
    }

    public String getPredicat(int count) {
        return Predicat[count];
    }


    public int getExotic_pic(int count) {
        return Exotic_pic[count];
    }

    public String getExotic_title(int count) {
        return Exotic_title[count];
    }

    public String getExotic_descrypt(int count) {
        return Exotic_descrypt[count];
    }

    public String getNeww(int count) {
        return neww[count];
    }

    public String[] getName() {
        return Name;
    }
}
